app/views/ordered_products/index.html.slim

    = link_to 'К списку продуктов', products_path, class: "btn btn-outline-primary"
- unless @current_order.ordered_products.blank?
  - @current_order.ordered_products.each do |ordered_product|
    .card.border-info.mb-3
      .card-header
        .row
---
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 51]]
SELECT "products".* FROM "products"

          | Добавлен
          = ordered_product.created_at.strftime('%F')
---
INSERT INTO "ordered_products" ("order_id", "product_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 54], ["product_id", 8], ["amount", "0.0"], ["created_at", "2019-06-13 13:28:46.863591"], ["updated_at", "2019-06-13 13:28:46.863591"]]
INSERT INTO "orders" ("status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "draft"], ["created_at", "2019-06-11 14:05:13.997060"], ["updated_at", "2019-06-11 14:05:13.997060"], ["user_id", 2]]