app/views/users/orders/index.html.slim

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 3]]
---
  br
- unless current_user.orders.blank?
  - current_user.orders.order("created_at DESC").each do |order|

SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 33]]
---
          - @total_price = 0
          - order.ordered_products.each do |ordered_product|

INSERT INTO "orders" ("status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "draft"], ["created_at", "2019-06-12 13:13:25.812782"], ["updated_at", "2019-06-12 13:13:25.812782"], ["user_id", 2]]
---
            | создан
            = order.created_at.strftime('%F')