app/views/users/orders/show.html.slim

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 33]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 36]]
---

- unless @order.ordered_products.blank?
  - @order.ordered_products.each do |ordered_product|
    .card.border-info.mb-3
      .card-header
        .row