app/controllers/application_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
INSERT INTO "orders" ("status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "draft"], ["created_at", "2019-06-12 13:13:25.812782"], ["updated_at", "2019-06-12 13:13:25.812782"], ["user_id", 2]]
---
	def set_current_order
		# session["current_order_id"] = nil
		current_user_id = nil
		if !current_user.nil?
			current_user_id = current_user.id
		end
		if session["current_order_id"]
			@current_order = Order.find(session["current_order_id"])
			if (@current_order.status != "draft")
				@current_order = Order.create(status: "draft")