app/controllers/ordered_products_controller.rb

	def index
		@total_price = 0
		@current_order.ordered_products.each do |ordered_product|
---
SELECT "products".* FROM "products"
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 77]]

	def new
		@productsIdArray ||= []

		@current_order.ordered_products.each do |ordered_product|
			@productsIdArray.push(ordered_product.product.id.to_s)
		end



		if @productsIdArray.include?(params[:product_id])

			@orderedProduct = OrderedProduct.find_by(
				product_id: params[:product_id],
				order_id: @current_order.id)

			@amount = params[:amount].to_i

			@orderedProduct.update_attributes(
				:amount => (@orderedProduct.amount + @amount),
				:price => @orderedProduct.product.price * (@orderedProduct.amount + @amount))
		else
			@orderedProduct = OrderedProduct.create(product_id: params[:product_id],
				order_id: @current_order.id,
				amount: params[:amount])
			@orderedProduct.update_attributes(
				:price => @orderedProduct.product.price * @orderedProduct.amount)
---
SELECT "products".* FROM "products"
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = $1  [["order_id", 77]]
INSERT INTO "orders" ("status", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["status", "draft"], ["created_at", "2019-06-11 11:17:16.362189"], ["updated_at", "2019-06-11 11:17:16.362189"]]
UPDATE "ordered_products" SET "price" = $1, "updated_at" = $2 WHERE "ordered_products"."id" = $3  [["price", "84900.0"], ["updated_at", "2019-06-13 16:01:20.621896"], ["id", 89]]
INSERT INTO "ordered_products" ("order_id", "product_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 59], ["product_id", 7], ["amount", 1], ["created_at", "2019-06-13 16:29:44.509702"], ["updated_at", "2019-06-13 16:29:44.509702"]]
SELECT  "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."product_id" = $1 AND "ordered_products"."order_id" = $2 LIMIT $3  [["product_id", 7], ["order_id", 77], ["LIMIT", 1]]
UPDATE "ordered_products" SET "amount" = $1, "price" = $2, "updated_at" = $3 WHERE "ordered_products"."id" = $4  [["amount", 2], ["price", "169800.0"], ["updated_at", "2019-06-14 12:37:34.491471"], ["id", 115]]
INSERT INTO "ordered_products" ("order_id", "product_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 85], ["product_id", 10], ["amount", 2], ["created_at", "2019-06-21 14:23:45.537066"], ["updated_at", "2019-06-21 14:23:45.537066"]]
UPDATE "ordered_products" SET "price" = $1, "updated_at" = $2 WHERE "ordered_products"."id" = $3  [["price", "21000.0"], ["updated_at", "2019-06-21 14:23:45.543975"], ["id", 126]]

	def destroy
		@ordered_product = OrderedProduct.find(params[:id])
		@ordered_product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]
DELETE FROM "ordered_products" WHERE "ordered_products"."id" = $1  [["id", 121]]