app/controllers/orders_controller.rb

UPDATE "orders" SET "status" = $1, "user_id" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["status", "canceled"], ["user_id", 2], ["updated_at", "2019-06-13 11:00:17.259251"], ["id", 43]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "canceled"], ["updated_at", "2019-06-13 11:34:59.826240"], ["id", 38]]
---
	def update
		current_user_id = nil
		if !current_user.nil?
			current_user_id = current_user.id
		end
		if (params[:order][:status] == 'created')
			@current_order.update_attributes(:status => params[:order][:status], :user_id => current_user_id)
			redirect_to ordered_products_path
		end

		if (params[:order][:status] == 'canceled')
			@order = Order.find(params[:id])
			@order.update_attributes(:status => params[:order][:status])