app/controllers/products_controller.rb

	def index

		if params[:category_id] && !params[:category_id].empty?
			@category = Category.find(params[:category_id])
			@product = @category.products
		else
			@product = Product.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products"

	def new
		@product = Product.new
		@categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "categories".* FROM "categories"

	def create
		@product = Product.new(post_params)
		@product.category_id = params[:category_id]
		if @product.save
---
INSERT INTO "products" ("category", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "Microphon"], ["title", ""], ["description", ""], ["created_at", "2019-06-11 12:42:46.103831"], ["updated_at", "2019-06-11 12:42:46.103831"]]