app/views/products/index.html.slim

SELECT "categories".* FROM "categories"
---
= form_with url: products_path, method: :get, local: true, :id => "app-cover" do |form|
    = form.select :category_id, options_from_collection_for_select(Category.all, :id,:name), :prompt => "Выберите категорию"